gdgly/powerPack/libraries/boot_rom/f28004x/rev0/rom_sources/F28004x_ROM/driverlib/xbar.h
//*****************************************************************************
//
//! The following values define the \e syncSrc parameter for
//! XBar_setSyncInputConfig(). Note that some of these are only valid for
//! certain values of \e syncInput. See device technical reference manual for
//! info on time-base counter synchronization for details.
//
//*****************************************************************************
typedef enum
{
    XBAR_SYNC_IN_SRC_EPWM1SYNCOUT,  //!< Valid for all values of syncInput
    XBAR_SYNC_IN_SRC_EPWM4SYNCOUT,
    XBAR_SYNC_IN_SRC_EPWM7SYNCOUT,
    XBAR_SYNC_IN_SRC_EPWM10SYNCOUT,
    XBAR_SYNC_IN_SRC_ECAP1SYNCOUT,
    XBAR_SYNC_IN_SRC_EXTSYNCIN1,    //!< Valid for all values of syncInput
    XBAR_SYNC_IN_SRC_EXTSYNCIN2,    //!< Valid for all values of syncInput
    XBAR_SYNC_IN_SRC_ECAP4SYNCOUT
} XBar_SyncInputSource;

//*****************************************************************************
//
//! The following values define the \e syncSrc parameter for
//! XBar_setSyncOutputConfig().
//
//*****************************************************************************
typedef enum
{
    XBAR_SYNC_OUT_SRC_EPWM1SYNCOUT,
    XBAR_SYNC_OUT_SRC_EPWM4SYNCOUT,
    XBAR_SYNC_OUT_SRC_EPWM7SYNCOUT,
    XBAR_SYNC_OUT_SRC_EPWM10SYNCOUT
} XBar_SyncOutputSource;

//*****************************************************************************
//
// Prototypes for the APIs.
//
//*****************************************************************************
//*****************************************************************************
//
//! Enables the output X-Bar mux values to be passed to the output signal.
//!
//! \param output is the X-Bar output being configured.
//! \param muxes is a bit field of the muxes to be enabled.
//!
//! This function enables the mux values to be passed to the X-Bar output
//! signal. The \e output parameter is a value \b XBAR_OUTPUTy where y is
//! the output number between 1 and 8 inclusive.
//!
//! The \e muxes parameter is a bit field of the muxes being enabled where bit
//! 0 represents mux 0, bit 1 represents mux 1 and so on. Defines are provided
//! in the form of \b XBAR_MUXnn that can be logically OR'd together to
//! enable several muxes on an output at the same time.
//!
//! \return None.
//
//*****************************************************************************
static inline void
XBar_enableOutputMux(XBar_OutputNum output, uint32_t muxes)
{
    //
    // Set the enable bit.
    //
    EALLOW;

    HWREG(XBAR_OUTPUT_EN_REG_BASE + (uint16_t)output) |= muxes;

    EDIS;
}

//*****************************************************************************
//
//! Disables the output X-Bar mux values from being passed to the output.
//!
//! \param output is the X-Bar output being configured.
//! \param muxes is a bit field of the muxes to be disabled.
//!
//! This function disables the mux values from being passed to the X-Bar output
//! signal. The \e output parameter is a value \b XBAR_OUTPUTy where y is
//! the output number between 1 and 8 inclusive.
//!
//! The \e muxes parameter is a bit field of the muxes being disabled where bit
//! 0 represents mux 0, bit 1 represents mux 1 and so on. Defines are provided
//! in the form of \b XBAR_MUXnn that can be logically OR'd together to
//! disable several muxes on an output at the same time.
//!
//! \return None.
//
//*****************************************************************************
static inline void
XBar_disableOutputMux(XBar_OutputNum output, uint32_t muxes)
{
    //
    // Clear the enable bit.
    //
    EALLOW;

    HWREG(XBAR_OUTPUT_EN_REG_BASE + (uint16_t)output) &= ~(muxes);

    EDIS;
}

//*****************************************************************************
//
//! Enables or disables the output latch to drive the selected output.
//!
//! \param output is the X-Bar output being configured.
//! \param enable is a flag that determines whether or not the latch is
//! selected to drive the X-Bar output.
//!
//! This function sets the output X-Bar output signal latch mode. If the
//! \e enable parameter is \b true, the output specified by \e output will be
//! driven by the output latch.
//!
//! \return None.
//
//*****************************************************************************
static inline void
XBar_setOutputLatchMode(XBar_OutputNum output, bool enable)
{
    EALLOW;

    //
    // Set or clear the latch setting bit based on the enable parameter.
    //
    if(enable)
    {
        HWREGH(OUTPUTXBAR_BASE + XBAR_O_OUTPUTLATCHENABLE) |=
            0x1U << ((uint16_t)output / 2U);
    }
    else
    {
        HWREGH(OUTPUTXBAR_BASE + XBAR_O_OUTPUTLATCHENABLE) &=
            ~(0x1U << ((uint16_t)output / 2U));
    }

    EDIS;
}

//*****************************************************************************
//
//! Returns the status of the output latch
//!
//! \param output is the X-Bar output being checked.
//!
//! \return Returns \b true if the output corresponding to \e output was
//! triggered. If not, it will return \b false.
//
//*****************************************************************************
static inline bool
XBar_getOutputLatchStatus(XBar_OutputNum output)
{
    //
    // Get the status of the output X-Bar output latch.
    //
    if((HWREGH(OUTPUTXBAR_BASE + XBAR_O_OUTPUTLATCH) &
        (0x1U << ((uint16_t)output / 2U))) != 0U)
    {
        return(true);
    }
    else
    {
        return(false);
    }
}

//*****************************************************************************
//
//! Clears the output latch for the specified output.
//!
//! \param output is the X-Bar output being configured.
//!
//! This function clears the output X-Bar output latch. The output to be
//! configured is specified by the \e output parameter.
//!
//! \return None.
//
//*****************************************************************************
static inline void
XBar_clearOutputLatch(XBar_OutputNum output)
{
    //
    // Set the bit that clears the corresponding OUTPUTLATCH bit.
    //
    HWREGH(OUTPUTXBAR_BASE + XBAR_O_OUTPUTLATCHCLR) |=
        (uint32_t)0x1U << ((uint16_t)output / 2U);
}

//*****************************************************************************
//
//! Forces the output latch for the specified output.
//!
//! \param output is the X-Bar output being configured.
//!
//! This function forces the output X-Bar output latch. The output to be
//! configured is specified by the \e output parameter.
//!
//! \return None.
//
//*****************************************************************************
static inline void
XBar_forceOutputLatch(XBar_OutputNum output)
{
    //
    // Set the bit that forces the corresponding OUTPUTLATCH bit.
    //
    HWREGH(OUTPUTXBAR_BASE + XBAR_O_OUTPUTLATCHFRC) =
        0x1U << ((uint16_t)output / 2U);
}

//*****************************************************************************
//
//! Configures the polarity of an output X-Bar output.
//!
//! \param output is the X-Bar output being configured.
//! \param invert is a flag that determines whether the output is active-high
//! or active-low.
//!
//! This function inverts the output X-Bar signal if the \e invert parameter is
//! \b true. If \e invert is \b false, the signal will be passed as is. The
//! \e output parameter is a value \b XBAR_OUTPUTy where y is the output
//! number between 1 and 8 inclusive.
//!
//! \return None.
//
//*****************************************************************************
static inline void
XBar_invertOutputSignal(XBar_OutputNum output, bool invert)
{
    //
    // Set or clear the polarity setting bit based on the invert parameter.
    //
    EALLOW;

    if(invert)
    {
        HWREGH(OUTPUTXBAR_BASE + XBAR_O_OUTPUTINV) |=
            0x1U << ((uint16_t)output / 2U);
    }
    else
    {
        HWREGH(OUTPUTXBAR_BASE + XBAR_O_OUTPUTINV) &=
            ~(0x1U << ((uint16_t)output / 2U));
    }

    EDIS;
}

//*****************************************************************************
//
//! Enables the ePWM X-Bar mux values to be passed to an ePWM module.
//!
//! \param trip is the X-Bar output being configured.
//! \param muxes is a bit field of the muxes to be enabled.
//!
//! This function enables the mux values to be passed to the X-Bar trip
//! signal. The \e trip parameter is a value \b XBAR_TRIPy where y is
//! the number of the trip signal on the ePWM.
//!
//! The \e muxes parameter is a bit field of the muxes being enabled where bit
//! 0 represents mux 0, bit 1 represents mux 1 and so on. Defines are provided
//! in the form of \b XBAR_MUXnn that can be logically OR'd together to
//! enable several muxes on an output at the same time.
//!
//! \return None.
//
//*****************************************************************************
static inline void
XBar_enableEPWMMux(XBar_TripNum trip, uint32_t muxes)
{
    //
    // Set the enable bit.
    //
    EALLOW;

    HWREG(XBAR_EPWM_EN_REG_BASE + (uint16_t)trip) |= muxes;

    EDIS;
}

//*****************************************************************************
//
//! Disables the ePWM X-Bar mux values to be passed to an ePWM module.
//!
//! \param trip is the X-Bar output being configured.
//! \param muxes is a bit field of the muxes to be disabled.
//!
//! This function disables the mux values to be passed to the X-Bar trip
//! signal. The \e trip parameter is a value \b XBAR_TRIPy where y is
//! the number of the trip signal on the ePWM.
//!
//! The \e muxes parameter is a bit field of the muxes being disabled where bit
//! 0 represents mux 0, bit 1 represents mux 1 and so on. Defines are provided
//! in the form of \b XBAR_MUXnn that can be logically OR'd together to
//! disable several muxes on an output at the same time.
//!
//! \return None.
//
//*****************************************************************************
static inline void
XBar_disableEPWMMux(XBar_TripNum trip, uint32_t muxes)
{
    //
    // Clear the enable bit.
    //
    EALLOW;

    HWREG(XBAR_EPWM_EN_REG_BASE + (uint16_t)trip) &= ~(muxes);

    EDIS;
}

//*****************************************************************************
//
//! Configures the polarity of an ePWM X-Bar output.
//!
//! \param trip is the X-Bar output being configured.
//! \param invert is a flag that determines whether the output is active-high
//! or active-low.
//!
//! This function inverts the ePWM X-Bar trip signal if the \e invert
//! parameter is \b true. If \e invert is \b false, the signal will be passed
//! as is. The \e trip parameter is a value \b XBAR_TRIPy where y is
//! the number of the trip signal on the ePWM X-Bar that is being configured.
//!
//! \return None.
//
//*****************************************************************************
static inline void
XBar_invertEPWMSignal(XBar_TripNum trip, bool invert)
{
    //
    // Set or clear the polarity setting bit based on the invert parameter.
    //
    EALLOW;

    if(invert)
    {
        HWREGH(EPWMXBAR_BASE + XBAR_O_TRIPOUTINV) |=
            0x1U << ((uint16_t)trip / 2U);
    }
    else
    {
        HWREGH(EPWMXBAR_BASE + XBAR_O_TRIPOUTINV) &=
            ~(0x1U << ((uint16_t)trip / 2U));
    }

    EDIS;
}

//*****************************************************************************
//
//! Sets the GPIO pin for an input X-Bar input.
//!
//! \param input is the X-Bar input being configured.
//! \param pin is the identifying number of the pin.
//!
//! This function configures which GPIO is assigned to an input X-Bar input.
//! The \e input parameter is a value in the form of a define \b XBAR_INPUTy
//! where y is a the input number for the input X-Bar.
//!
//! The pin is specified by its numerical value. For example, GPIO34 is
//! specified by passing 34 as \e pin.
//!
//! \return None.
//
//*****************************************************************************
static inline void
XBar_setInputPin(XBar_InputNum input, uint16_t pin)
{
    //
    // Check the argument.
    //
    ASSERT(pin <= 168U);

    //
    // Write the requested pin to the appropriate input select register.
    //
    EALLOW;

    HWREGH(XBAR_INPUT_BASE + (uint16_t)input) = pin;

    EDIS;
}

//*****************************************************************************
//
//! Configures the sync input source for the ePWM and eCAP signals.
//!
//! \param syncInput is the sync input being configured
//! \param syncSrc is sync input source selection.
//!
//! This function configures the sync input source for the ePWM and eCAP
//! modules. The \e syncInput parameter is the sync input being configured. It
//! should be passed a value of \b XBAR_SYNC_IN_XXXX, where XXXX is the ePWM or
//! eCAP instance the sync signal is entering.
//!
//! The \e syncSrc parameter is the sync signal selected as the source of the
//! sync input. It should be passed a value of \b XBAR_SYNC_IN_SRC_XXXX, where
//! XXXX is a sync signal coming from an ePWM, eCAP or external sync output.
//! For example, a \e syncInput value of \b XBAR_SYNC_IN_ECAP1 and a
//! \e syncSrc value of \b XBAR_SYNC_IN_SRC_EPWM1SYNCOUT will make the
//! EPWM1SYNCOUT signal drive eCAP1's SYNCIN signal.
//!
//! Note that some \e syncSrc values are only valid for certain values of
//! \e syncInput. See device technical reference manual for info on time-base
//! counter synchronization for details.
//!
//! \return None.
//
//*****************************************************************************
static inline void
XBar_setSyncInputConfig(XBar_SyncInput syncInput, XBar_SyncInputSource syncSrc)
{
    uint32_t clearMask;

