gdgly/powerPack/libraries/boot_rom/f28004x/rev0/rom_sources/F28004x_ROM/driverlib/xbar.h
    clearMask = (uint32_t)XBAR_SYNCSELECT_SYNCIN_M << (uint32_t)syncInput;

    //
    // Write the input sync source selection to the appropriate register.
    //
    EALLOW;
    HWREG(TRIGXBAR_BASE + XBAR_O_SYNCSELECT) =
        (HWREG(TRIGXBAR_BASE + XBAR_O_SYNCSELECT) & ~clearMask) |
        ((uint32_t)syncSrc << (uint32_t)syncInput);
    EDIS;
}

//*****************************************************************************
//
//! Configures the sync output source.
//!
//! \param syncSrc is sync output source selection.
//!
//! This function configures the sync output source from the ePWM modules. The
//! \e syncSrc parameter is a value \b XBAR_SYNC_OUT_SRC_XXXX, where XXXX is a
//! sync signal coming from an ePWM such as XBAR_SYNC_OUT_SRC_EPWM1SYNCOUT
//!
//! \return None.
//
//*****************************************************************************
static inline void
XBar_setSyncOutputConfig(XBar_SyncOutputSource syncSrc)
{
    //
    // Write the sync output source selection to the appropriate register.
    //
    EALLOW;
    HWREG(TRIGXBAR_BASE + XBAR_O_SYNCSELECT) =
        (HWREG(TRIGXBAR_BASE + XBAR_O_SYNCSELECT) &
         ~((uint32_t)XBAR_SYNCSELECT_SYNCOUT_M)) |
        ((uint32_t)syncSrc << XBAR_SYNCSELECT_SYNCOUT_S);
    EDIS;
}

//*****************************************************************************
//
//! Enables ePWM SOC signals to drive an external ADCSOC signal.
//!
//! \param adcsocSrc is a bit field of the selected signals to be enabled
//!
//! This function configures which ePWM SOC signals are enabled as a source for
//! either ADCSOCAO or ADCSOCBO. The \e adcsocSrc parameter takes a logical OR
//! of \b XBAR_ADCSOC_SRC_PWMxSOCA/B values that correspond to different
//! signals.
//!
//! \return None.
//
//*****************************************************************************
static inline void
XBar_enableExtADCSOCSource(uint32_t adcsocSrc)
{
    //
    // Set the bits that correspond to signal to be enabled.
    //
    EALLOW;
    HWREG(TRIGXBAR_BASE + XBAR_O_EXTADCSOCSELECT) |= adcsocSrc;
    EDIS;
}

//*****************************************************************************
//
//! Disables ePWM SOC signals from driving an external ADCSOC signal.
//!
//! \param adcsocSrc is a bit field of the selected signals to be disabled
//!
//! This function configures which ePWM SOC signals are disabled as a source
//! for either ADCSOCAO or ADCSOCBO. The \e adcsocSrc parameter takes a logical
//! OR of \b XBAR_ADCSOC_SRC_PWMxSOCA/B values that correspond to different
//! signals.
//!
//! \return None.
//
//*****************************************************************************
static inline void
XBar_disableExtADCSOCSource(uint32_t adcsocSrc)
{
    //
    // Clear the bits that correspond to signal to be disabled.
    //
    EALLOW;
    HWREG(TRIGXBAR_BASE + XBAR_O_EXTADCSOCSELECT) &= ~adcsocSrc;
    EDIS;
}

//*****************************************************************************
//
//! Locks an input to the Input X-Bar.
//!
//! \param input is an input to the Input X-Bar.
//!
//! This function locks the specific input on the Input X-Bar.
//!
//! \return None.
//
//*****************************************************************************
static inline void
XBar_lockInput(XBar_InputNum input)
{
    //
    // lock the input in the INPUTSELECTLOCK register.
    //
    EALLOW;
    HWREG(INPUTXBAR_BASE + XBAR_O_INPUTSELECTLOCK) =
        (uint32_t)1U << (uint32_t)input;
    EDIS;
}

//*****************************************************************************
//
//! Locks the Output X-Bar.
//!
//! This function locks the Output X-Bar.
//!
//! \return None.
//
//*****************************************************************************
static inline void
XBar_lockOutput(void)
{
    //
    // Lock the Output X-Bar with the OUTPUTLOCK register.
    // Write key 0x5A5A to the KEY bits and 1 to LOCK bit.
    //
    EALLOW;

    HWREG(OUTPUTXBAR_BASE + XBAR_O_OUTPUTLOCK) =
        ((uint32_t)0x5A5A << XBAR_OUTPUTLOCK_KEY_S) |
        (uint32_t)XBAR_OUTPUTLOCK_LOCK;

    EDIS;
}

//*****************************************************************************
//
//! Locks the SOC Select of the Trig X-Bar.
//!
//! This function locks the external ADC SOC select of the Trig X-Bar.
//!
//! \return None.
//
//*****************************************************************************
static inline void
XBar_lockSOCSelect(void)
{
    //
    // Lock the EXTADCSOCSELECT bit of the SYNCSOCLOCK register.
    //
    EALLOW;
    HWREG(TRIGXBAR_BASE + XBAR_O_SYNCSOCLOCK) =
        XBAR_SYNCSOCLOCK_EXTADCSOCSELECT;
    EDIS;
}

//*****************************************************************************
//
//! Locks the Sync Select of the Trig X-Bar.
//!
//! This function locks Sync Input and Output Select of the Trig X-Bar.
//!
//! \return None.
//
//*****************************************************************************
static inline void
XBar_lockSyncSelect(void)
{
    //
    // Lock the EXTADCSOCSELECT bit of the SYNCSOCLOCK register.
    //
    EALLOW;
    HWREG(TRIGXBAR_BASE + XBAR_O_SYNCSOCLOCK) = XBAR_SYNCSOCLOCK_SYNCSELECT;
    EDIS;
}

//*****************************************************************************
//
//! Locks the ePWM X-Bar.
//!
//! This function locks the ePWM X-Bar.
//!
//! \return None.
//
//*****************************************************************************
static inline void
XBar_lockEPWM(void)
{
    //
    // Lock the EPWM X-Bar with the TRIPLOCK register.
    // Write key 0x5A5A to the KEY bits and 1 to LOCK bit.
    //
    EALLOW;

    HWREG(EPWMXBAR_BASE + XBAR_O_TRIPLOCK) =
        ((uint32_t)0x5A5A << XBAR_TRIPLOCK_KEY_S) |
        (uint32_t)XBAR_TRIPLOCK_LOCK;

    EDIS;
}

//*****************************************************************************
//
//! Configures the output X-Bar mux that determines the signals passed to an
//! output.
//!
//! \param output is the X-Bar output being configured.
//! \param muxConfig is mux configuration that specifies the signal.
//!
//! This function configures an output X-Bar mux. This determines which
//! signal(s) should be passed through the X-Bar to a GPIO. The \e output
//! parameter is a value \b XBAR_OUTPUTy where y is a the output number
//! between 1 and 8 inclusive.
//!
//! The \e muxConfig parameter is the mux configuration value that specifies
//! which signal will be passed from the mux. The values have the format of
//! \b XBAR_OUT_MUXnn_xx where the 'xx' is the signal and nn is the mux
//! number (00 through 11). The possible values are found in <tt>xbar.h</tt>
//!
//! This function may be called for each mux of an output and their values will
//! be logically OR'd before being passed to the output signal. This means that
//! this function may be called, for example, with the argument
//! \b XBAR_OUT_MUX00_ECAP1_OUT and then with the argument
//! \b XBAR_OUT_MUX01_INPUTXBAR1, resulting in the values of MUX00 and MUX03
//! being logically OR'd if both are enabled. Calling the function twice for
//! the same mux on the output will result in the configuration in the second
//! call overwriting the first.
//!
//! \return None.
//
//*****************************************************************************
extern void
XBar_setOutputMuxConfig(XBar_OutputNum output, XBar_OutputMuxConfig muxConfig);

//*****************************************************************************
//
//! Configures the ePWM X-Bar mux that determines the signals passed to an
//! ePWM module.
//!
//! \param trip is the X-Bar output being configured.
//! \param muxConfig is mux configuration that specifies the signal.
//!
//! This function configures an ePWM X-Bar mux. This determines which signal(s)
//! should be passed through the X-Bar to an ePWM module. The \e trip
//! parameter is a value \b XBAR_TRIPy where y is a the number of the trip
//! signal on the ePWM.
//!
//! The \e muxConfig parameter is the mux configuration value that specifies
//! which signal will be passed from the mux. The values have the format of
//! \b XBAR_EPWM_MUXnn_xx where the 'xx' is the signal and nn is the mux
//! number (0 through 31). The possible values are found in <tt>xbar.h</tt>
//!
//! This function may be called for each mux of an output and their values will
//! be logically OR'd before being passed to the trip signal. This means that
//! this function may be called, for example, with the argument
//! \b XBAR_EPWM_MUX00_ECAP1_OUT and then with the argument
//! \b XBAR_EPWM_MUX01_INPUTXBAR1, resulting in the values of MUX00 and MUX03
//! being logically OR'd if both are enabled. Calling the function twice for
//! the same mux on the output will result in the configuration in the second
//! call overwriting the first.
//!
//! \return None.
//
//*****************************************************************************
extern void
XBar_setEPWMMuxConfig(XBar_TripNum trip, XBar_EPWMMuxConfig muxConfig);

//*****************************************************************************
//
//! Returns the status of the input latch.
//!
//! \param inputFlag is the X-Bar input latch being checked. Values are in the
//! format of /b XBAR_INPUT_FLG_XXXX where "XXXX" is name of the signal.
//!
//! \return Returns \b true if the X-Bar input corresponding to the
//! \e inputFlag has been triggered. If not, it will return \b false.
//
//*****************************************************************************
extern bool
XBar_getInputFlagStatus(XBar_InputFlag inputFlag);

//*****************************************************************************
//
//! Clears the input latch for the specified input latch.
//!
//! \param inputFlag is the X-Bar input latch being cleared.
//!
//! This function clears the input X-Bar input latch. The input latch to be
//! cleared is specified by the \e inputFlag parameter.
//!
//! \return None.
//
//*****************************************************************************
extern void
XBar_clearInputFlag(XBar_InputFlag inputFlag);

//*****************************************************************************
//
// Close the Doxygen group.
//! @}
//
//*****************************************************************************

//*****************************************************************************
//
// Mark the end of the C bindings section for C++ compilers.
//
//*****************************************************************************
#ifdef __cplusplus
}
#endif

#endif // __XBAR_H__
